app/controllers/matches_controller.rb

    def index
        @matches = Match.order("created_at").all
---
SELECT "matches".* FROM "matches" ORDER BY created_at

    def new
        # if we should save the posted form
        if request.post?

            @match = Match.new(match_params)

            if @match.save
                redirect_to action: 'index'
            end
        else
            # default add form (get request)
            @match = Match.new
            @members = Member.all
---
INSERT INTO "matches" ("user_id", "challenger_id", "created_at", "updated_at", "match_status") VALUES (?, ?, ?, ?, ?)  [["user_id", 38], ["challenger_id", 39], ["created_at", "2020-11-30 06:01:26.428976"], ["updated_at", "2020-11-30 06:01:26.428976"], ["match_status", "challenger_won"]]
SELECT "members".* FROM "members" WHERE (current_rank >= 2 AND current_rank < 3) ORDER BY "members"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def delete
        match = Match.find(params[:id])
        match.destroy
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "matches" WHERE "matches"."id" = ?  [["id", 1]]