app/controllers/members_controller.rb

    def index
        @members = Member.order("current_rank").all
---
SELECT "members".* FROM "members" ORDER BY current_rank

    def new
        # if we should save the posted form
        if request.post?

            @member = Member.new(member_params)
            if @member.save
---
INSERT INTO "members" ("name", "email", "dob", "current_rank", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Theo"], ["email", "ferreiratheos@gmail.com"], ["dob", "2020-11-11"], ["current_rank", 1], ["created_at", "2020-11-29 12:49:02.001096"], ["updated_at", "2020-11-29 12:49:02.001096"]]

    def delete
        member = Member.find(params[:id])
        member.destroy
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 2]]

    def edit
        # locate existing article
        @member = Member.find(params[:id])

        # if we should save the posted form
        if request.post?
            if @member.update(member_params)
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "name" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["name", "theods"], ["updated_at", "2020-11-29 07:53:08.289262"], ["id", 1]]