app/models/match.rb

    def update_match_count
        user.update(num_games: user.num_games + 1)
        challenger.update(num_games: challenger.num_games + 1)
---
UPDATE "matches" SET "user_rank" = ?, "challenger_rank" = ?, "updated_at" = ? WHERE "matches"."id" = ?  [["user_rank", 2], ["challenger_rank", 3], ["updated_at", "2020-11-30 11:30:56.287601"], ["id", 4]]

    def update_draw(who_won)
        update_id = (who_won == 'challenger') ? challenger_id : user_id
        user = Member.find(update_id)

        # Lower rank - 1
        member_update = Member.where(current_rank: (user.current_rank - 1)).first
        member_update.update(current_rank: (update_member.current_rank + 1))
        user.update(current_rank: (user.current_rank - 1))
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 65], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."current_rank" = ? ORDER BY "members"."id" ASC LIMIT ?  [["current_rank", 3], ["LIMIT", 1]]
UPDATE "matches" SET "user_rank_new" = ?, "challenger_rank_new" = ?, "updated_at" = ? WHERE "matches"."id" = ?  [["user_rank_new", 3], ["challenger_rank_new", 3], ["updated_at", "2020-12-05 09:24:29.787208"], ["id", 3]]
UPDATE "members" SET "current_rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["current_rank", 4], ["updated_at", "2020-12-05 09:06:18.623078"], ["id", 66]]
UPDATE "matches" SET "user_rank_new" = ?, "challenger_rank_new" = ?, "updated_at" = ? WHERE "matches"."id" = ?  [["user_rank_new", 1], ["challenger_rank_new", 2], ["updated_at", "2020-11-30 05:37:22.277335"], ["id", 3]]

    def update_won(who_won)

        won_id = (who_won == 'challenger') ? challenger_id : user_id
        lost_id = (who_won == 'challenger') ? user_id : challenger_id
        won_rank = (who_won == 'challenger') ? challenger_rank : user_rank
        lost_rank = (who_won == 'challenger') ? user_rank : challenger_rank
        member_won = Member.find(won_id) # (1)
        member_lost = Member.find(lost_id)

        # Higher rank + 1
        member_lost_update = Member.where(current_rank: (member_lost.current_rank + 1)).first
        member_lost_update.update(current_rank: member_lost_update.current_rank - 1)
        member_lost.update(current_rank: (member_lost.current_rank + 1))

        # Lower rank = lower rank half difference (16 - 10) / 2 = 3
        new_rank = won_rank - ((won_rank - lost_rank).to_f / 2).ceil

        #update all effected ranks
        update_members = Member.where("current_rank >= ? AND current_rank < ?",new_rank,won_rank).all
        update_members.each do |update_member|
            update_member.update(current_rank: (update_member.current_rank + 1))
        end

        #update winning rank # (2)
        member_won.update(current_rank: new_rank)
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 55], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."current_rank" = ? ORDER BY "members"."id" ASC LIMIT ?  [["current_rank", 2], ["LIMIT", 1]]
UPDATE "matches" SET "user_rank_new" = ?, "challenger_rank_new" = ?, "updated_at" = ? WHERE "matches"."id" = ?  [["user_rank_new", 1], ["challenger_rank_new", 3], ["updated_at", "2020-11-30 05:02:36.991916"], ["id", 2]]
UPDATE "members" SET "current_rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["current_rank", 1], ["updated_at", "2020-11-30 12:08:57.219838"], ["id", 55]]
UPDATE "matches" SET "user_rank_new" = ?, "challenger_rank_new" = ?, "updated_at" = ? WHERE "matches"."id" = ?  [["user_rank_new", 3], ["challenger_rank_new", 2], ["updated_at", "2020-11-30 11:57:19.422965"], ["id", 2]]
UPDATE "members" SET "current_rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["current_rank", 2], ["updated_at", "2020-11-30 12:08:57.222580"], ["id", 53]]
SELECT "members".* FROM "members" WHERE (current_rank >= 2 AND current_rank < 3) ORDER BY "members"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE (current_rank >= 1 AND current_rank < 2)
UPDATE "members" SET "current_rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["current_rank", 2], ["updated_at", "2020-11-30 12:08:57.226093"], ["id", 55]]
UPDATE "members" SET "current_rank" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["current_rank", 2], ["updated_at", "2020-11-30 05:48:47.279478"], ["id", 36]]