app/models/member.rb

    def set_rank
        self.current_rank = Member.count + 1
---
SELECT COUNT(*) FROM "members"